Revit 2026 API

# RebarStyle Enumeration

---

Describes the usage style of a RebarShape. The style affects the bend radius and the set of allowable hooks. It also affects Rebar instance auto-constraining behavior.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarStyle
```
```vb
Public Enumeration RebarStyle
```
```cpp
public enum class RebarStyle
```
```fsharp
type RebarStyle
```

| Member name | Value | Description |
| --- | --- | --- |
| Standard | 0 | A standard or longitudinal bar. |
| StirrupTie | 1 | A stirrup or tie bar. |

#### Reference

Autodesk.Revit.DB.Structure Namespace